&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Считываем фото из базы данных в форму при открытии карточки
	АдресФото = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Фотография");
	
КонецПроцедуры

&НаКлиенте
Процедура АдресФотоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения, , , Истина, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	АдресФото = Адрес;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если в адресе временное хранилище — пользователь выбрал новую картинку
	Если ЭтоАдресВременногоХранилища(АдресФото) Тогда
		
		// Записываем бинарные данные картинки в реквизит объекта базы данных
		ТекущийОбъект.Фотография = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФото));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Обновляем ссылку на постоянную, чтобы картинка не исчезла после записи
	АдресФото = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка, "Фотография");
	
КонецПроцедуры
